* Emacs configuration

** Enable debugging the config
#+BEGIN_SRC emacs-lisp
  (setq debug-on-error t)
#+END_SRC

** Basic editor window settings
#+BEGIN_SRC emacs-lisp
  ;; Disable startup message
  (setq inhibit-startup-message t)

  (menu-bar-mode -1)   ; Disable menu bar
  (tool-bar-mode -1)   ; Disable tool bar
  (scroll-bar-mode -1) ; Disable scroll bar
  (tooltip-mode -1)    ; Disable tool tip
  (set-fringe-mode 10) ; Give some breathing room

  ;; (setq visible-bell t); Setup a visible bell
#+END_SRC

#+RESULTS:
: ((vertical-scroll-bars) (left-fringe . 10) (right-fringe . 10))

** Editor base settings
#+BEGIN_SRC emacs-lisp
  (global-display-line-numbers-mode t) ; Enable line numbers
  (column-number-mode t)               ; Enable column numbers in status
#+END_SRC

#+RESULTS:
: t

** Initialise packages
#+BEGIN_SRC emacs-lisp
  (require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))
  (require 'use-package)
  (setq use-package-always-ensure t)
#+END_SRC

#+RESULTS:

** Setting the theme
#+BEGIN_SRC emacs-lisp
  (unless (package-installed-p 'catppuccin-theme)
    (package-install 'catppuccin-theme))
  (load-theme 'catppuccin :no-confirm)
#+END_SRC

#+RESULTS:
: t

** Backup files and autosave
#+BEGIN_SRC emacs-lisp
  (setq make-backup-files nil)
  (setq auto-save-default nil)
#+END_SRC

#+RESULTS:

** Better scrolling
#+BEGIN_SRC emacs-lisp
  (setq scroll-conservatively 100) ; Avoid jumping when scrolling
#+END_SRC

** Font settings
#+BEGIN_SRC emacs-lisp
  (set-face-attribute 'default nil
		      :font "JetBrainsMono Nerd Font"
		      :height 120
		      )
#+END_SRC
